01  WS-DATA-AREA. 
    05 WS-DATE-1 PIC 9(8). 
    05 WS-DATE-2 PIC 9(8). 
    05 WS-DATE-3 REDEFINES WS-DATE-1 PIC X(8). 
    05 WS-DATE-4 REDEFINES WS-DATE-2 PIC X(8). 

PROCEDURE DIVISION. 
    MOVE 20231026 TO WS-DATE-1 
    MOVE 20231027 TO WS-DATE-2 
    DISPLAY WS-DATE-3 
    DISPLAY WS-DATE-4 
    STOP RUN.