01  WS-DATA-AREA. 
    05 WS-DATE-1 PIC 9(8). 
    05 WS-DATE-2 PIC 9(8). 
    05 WS-DATE-3 REDEFINES WS-DATE-1 PIC X(8). 
    05 WS-DATE-4 REDEFINES WS-DATE-2 PIC X(8). 
    05 WS-DISPLAY-DATE-1 PIC 9(8). 
    05 WS-DISPLAY-DATE-2 PIC 9(8). 

PROCEDURE DIVISION. 
    MOVE 20231026 TO WS-DATE-1 
    MOVE 20231027 TO WS-DATE-2 
    MOVE WS-DATE-1 TO WS-DISPLAY-DATE-1 
    MOVE WS-DATE-2 TO WS-DISPLAY-DATE-2 
    DISPLAY WS-DISPLAY-DATE-1 
    DISPLAY WS-DISPLAY-DATE-2 
    STOP RUN.